ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v5.0
processor: MCIMX6DPxxYM
package_id: MCIMX6DP5EYM1AA
mcu_data: i_mx_1_0
processor_version: 5.0.0
pin_labels:
- {pin_num: T5, pin_signal: GPIO_0, label: PM_INT_N, identifier: PM_INT_N}
- {pin_num: T1, pin_signal: GPIO_2, label: ETH_PWR_EN, identifier: ETH_PWR_EN}
- {pin_num: T4, pin_signal: GPIO_1, label: USB_OTG_ID, identifier: USB_OTG_ID}
- {pin_num: R7, pin_signal: GPIO_3, label: PHY_RSTn, identifier: PHY_RSTn}
- {pin_num: R6, pin_signal: GPIO_4, label: SOC_FLOAT_TRIP1, identifier: SOC_FLOAT_TRIP1}
- {pin_num: R4, pin_signal: GPIO_5, label: SOC_FLOAT_TRIP2, identifier: SOC_FLOAT_TRIP2}
- {pin_num: T3, pin_signal: GPIO_6, label: SER_PWR_EN, identifier: SER_PWR_EN}
- {pin_num: T2, pin_signal: GPIO_9, label: SOC_LED, identifier: SOC_LED}
- {pin_num: R2, pin_signal: GPIO_16, label: SOC_REED1, identifier: SOC_REED1}
- {pin_num: R1, pin_signal: GPIO_17, label: SOC_REED2, identifier: SOC_REED2}
- {pin_num: P6, pin_signal: GPIO_18, label: SOC_REED3, identifier: SOC_REED3}
- {pin_num: P5, pin_signal: GPIO_19, label: SOC_REED4, identifier: SOC_REED4}
- {pin_num: F15, pin_signal: NANDF_CS0, label: ACCEL_INT_B, identifier: ACCEL_INT_B}
- {pin_num: C16, pin_signal: NANDF_CS1, label: MAG_INT_B, identifier: MAG_INT_B}
- {pin_num: A17, pin_signal: NANDF_CS2, label: MAG_DRDY, identifier: MAG_DRDY}
- {pin_num: C15, pin_signal: NANDF_CLE, label: SOC_SURGE_DET2, identifier: SOC_SURGE_DET2}
- {pin_num: A16, pin_signal: NANDF_ALE, label: SOC_SURGE_DET1, identifier: SOC_SURGE_DET1}
- {pin_num: E15, pin_signal: NANDF_WP_B, label: SOC_SURGE_DET3, identifier: SOC_SURGE_DET3}
- {pin_num: B16, pin_signal: NANDF_RB0, label: SOC_SURGE_DET4, identifier: SOC_SURGE_DET4}
- {pin_num: A18, pin_signal: NANDF_D0, label: GPIO2_0, identifier: GPIO2_0}
- {pin_num: C17, pin_signal: NANDF_D1, label: GPIO2_1, identifier: GPIO2_1}
- {pin_num: F16, pin_signal: NANDF_D2, label: GPIO2_2, identifier: GPIO2_2}
- {pin_num: D17, pin_signal: NANDF_D3, label: GPIO2_3, identifier: GPIO2_3}
- {pin_num: A19, pin_signal: NANDF_D4, label: SOC_SURGE_DET5, identifier: SOC_SURGE_DET5}
- {pin_num: E17, pin_signal: NANDF_D6, label: PS2SOC_PG, identifier: PS2SOC_PG}
- {pin_num: E18, pin_signal: SD4_DAT4, label: FAN1_SP_CTRL, identifier: FAN1_SP_CTRL}
- {pin_num: C19, pin_signal: SD4_DAT5, label: FAN2_SP_CTRL, identifier: FAN2_SP_CTRL}
- {pin_num: B20, pin_signal: SD4_DAT6, label: FAN_TACH_DSP0, identifier: FAN_TACH_DSP0}
- {pin_num: D19, pin_signal: SD4_DAT7, label: FAN_TACH_DSP1, identifier: FAN_TACH_DSP1}
- {pin_num: C25, pin_signal: EIM_D16, label: RTD_DRDYn, identifier: RTD_DRDYn}
- {pin_num: G21, pin_signal: EIM_D19, label: RTD_START_SYNC, identifier: RTD_START_SYNC}
- {pin_num: G20, pin_signal: EIM_D20, label: PM_RESET_N, identifier: PM_RESET_N}
- {pin_num: H20, pin_signal: EIM_D21, label: USB_OTG_OCn, identifier: USB_OTG_OCn}
- {pin_num: E23, pin_signal: EIM_D22, label: USB_OTG_PWR, identifier: USB_OTG_PWR}
- {pin_num: D25, pin_signal: EIM_D23, label: SOC_THER_SW1, identifier: SOC_THER_SW1}
- {pin_num: F22, pin_signal: EIM_D24, label: SOC_THER_SW2, identifier: SOC_THER_SW2}
- {pin_num: J20, pin_signal: EIM_D30, label: SOC_THER_SW3, identifier: SOC_THER_SW3}
- {pin_num: H21, pin_signal: EIM_D31, label: SOC_THER_SW4, identifier: SOC_THER_SW4}
- {pin_num: J19, pin_signal: EIM_D29, label: PMIC_INT_B, identifier: PMIC_INT_B}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'false', coreID: ca9_0}
- pin_list:
  - {pin_num: U7, peripheral: ECSPI1, signal: miso, pin_signal: KEY_COL1}
  - {pin_num: R5, peripheral: FLEXCAN1, signal: rxcan, pin_signal: GPIO_8}
  - {pin_num: R3, peripheral: FLEXCAN1, signal: txcan, pin_signal: GPIO_7}
  - {pin_num: V5, peripheral: FLEXCAN2, signal: rxcan, pin_signal: KEY_ROW4}
  - {pin_num: T6, peripheral: FLEXCAN2, signal: txcan, pin_signal: KEY_COL4}
  - {pin_num: V21, peripheral: ENET, signal: tx_en, pin_signal: ENET_TX_EN}
  - {pin_num: E19, peripheral: PWM2, signal: pwmo, pin_signal: SD1_DAT2}
  - {pin_num: D24, peripheral: I2C3, signal: sda, pin_signal: EIM_D18}
  - {pin_num: F21, peripheral: I2C3, signal: scl, pin_signal: EIM_D17}
  - {pin_num: M1, peripheral: UART1, signal: txd_mux, pin_signal: CSI0_DAT10}
  - {pin_num: M3, peripheral: UART1, signal: rxd_mux, pin_signal: CSI0_DAT11}
  - {pin_num: N5, peripheral: I2C1, signal: scl, pin_signal: CSI0_DAT9}
  - {pin_num: N6, peripheral: I2C1, signal: sda, pin_signal: CSI0_DAT8}
  - {pin_num: T5, peripheral: GPIO1, signal: 'gpio, 0', pin_signal: GPIO_0, direction: INPUT}
  - {pin_num: T1, peripheral: GPIO1, signal: 'gpio, 2', pin_signal: GPIO_2, direction: OUTPUT}
  - {pin_num: R7, peripheral: GPIO1, signal: 'gpio, 3', pin_signal: GPIO_3, direction: OUTPUT}
  - {pin_num: R6, peripheral: GPIO1, signal: 'gpio, 4', pin_signal: GPIO_4, direction: INPUT}
  - {pin_num: R4, peripheral: GPIO1, signal: 'gpio, 5', pin_signal: GPIO_5, direction: INPUT}
  - {pin_num: T3, peripheral: GPIO1, signal: 'gpio, 6', pin_signal: GPIO_6, direction: OUTPUT}
  - {pin_num: R2, peripheral: GPIO7, signal: 'gpio, 11', pin_signal: GPIO_16, direction: INPUT}
  - {pin_num: R1, peripheral: GPIO7, signal: 'gpio, 12', pin_signal: GPIO_17, direction: INPUT}
  - {pin_num: P6, peripheral: GPIO7, signal: 'gpio, 13', pin_signal: GPIO_18, direction: INPUT}
  - {pin_num: P5, peripheral: GPIO4, signal: 'gpio, 5', pin_signal: GPIO_19, direction: INPUT}
  - {pin_num: F15, peripheral: GPIO6, signal: 'gpio, 11', pin_signal: NANDF_CS0, direction: INPUT}
  - {pin_num: C16, peripheral: GPIO6, signal: 'gpio, 14', pin_signal: NANDF_CS1, direction: INPUT}
  - {pin_num: A17, peripheral: GPIO6, signal: 'gpio, 15', pin_signal: NANDF_CS2, direction: INPUT}
  - {pin_num: C15, peripheral: GPIO6, signal: 'gpio, 7', pin_signal: NANDF_CLE, direction: INPUT}
  - {pin_num: A16, peripheral: GPIO6, signal: 'gpio, 8', pin_signal: NANDF_ALE, direction: INPUT}
  - {pin_num: E15, peripheral: GPIO6, signal: 'gpio, 9', pin_signal: NANDF_WP_B, direction: INPUT}
  - {pin_num: B16, peripheral: GPIO6, signal: 'gpio, 10', pin_signal: NANDF_RB0, direction: INPUT}
  - {pin_num: A18, peripheral: GPIO2, signal: 'gpio, 0', pin_signal: NANDF_D0, direction: OUTPUT}
  - {pin_num: C17, peripheral: GPIO2, signal: 'gpio, 1', pin_signal: NANDF_D1, direction: OUTPUT}
  - {pin_num: F16, peripheral: GPIO2, signal: 'gpio, 2', pin_signal: NANDF_D2, direction: OUTPUT}
  - {pin_num: D17, peripheral: GPIO2, signal: 'gpio, 3', pin_signal: NANDF_D3, direction: OUTPUT}
  - {pin_num: A19, peripheral: GPIO2, signal: 'gpio, 4', pin_signal: NANDF_D4, direction: INPUT}
  - {pin_num: E17, peripheral: GPIO2, signal: 'gpio, 6', pin_signal: NANDF_D6, direction: INPUT}
  - {pin_num: E18, peripheral: GPIO2, signal: 'gpio, 12', pin_signal: SD4_DAT4, direction: OUTPUT}
  - {pin_num: C19, peripheral: GPIO2, signal: 'gpio, 13', pin_signal: SD4_DAT5, direction: OUTPUT}
  - {pin_num: B20, peripheral: GPIO2, signal: 'gpio, 14', pin_signal: SD4_DAT6, direction: INPUT}
  - {pin_num: D19, peripheral: GPIO2, signal: 'gpio, 15', pin_signal: SD4_DAT7, direction: INPUT}
  - {pin_num: C25, peripheral: GPIO3, signal: 'gpio, 16', pin_signal: EIM_D16, direction: INPUT}
  - {pin_num: G21, peripheral: GPIO3, signal: 'gpio, 19', pin_signal: EIM_D19, direction: OUTPUT}
  - {pin_num: G20, peripheral: GPIO3, signal: 'gpio, 20', pin_signal: EIM_D20, direction: OUTPUT}
  - {pin_num: D25, peripheral: GPIO3, signal: 'gpio, 23', pin_signal: EIM_D23, direction: INPUT}
  - {pin_num: F22, peripheral: GPIO3, signal: 'gpio, 24', pin_signal: EIM_D24, direction: INPUT}
  - {pin_num: J20, peripheral: GPIO3, signal: 'gpio, 30', pin_signal: EIM_D30, direction: INPUT}
  - {pin_num: H21, peripheral: GPIO3, signal: 'gpio, 31', pin_signal: EIM_D31, direction: INPUT}
  - {pin_num: V20, peripheral: ENET, signal: mdc, pin_signal: ENET_MDC}
  - {pin_num: V23, peripheral: ENET, signal: mdio, pin_signal: ENET_MDIO}
  - {pin_num: W23, peripheral: ENET, signal: rx_er, pin_signal: ENET_RX_ER}
  - {pin_num: V6, peripheral: ECSPI1, signal: mosi, pin_signal: KEY_ROW0}
  - {pin_num: U6, peripheral: ECSPI1, signal: ss0, pin_signal: KEY_ROW1}
  - {pin_num: J19, peripheral: GPIO3, signal: 'gpio, 29', pin_signal: EIM_D29, direction: INPUT}
  - {pin_num: B13, peripheral: uSDHC3, signal: cmd, pin_signal: SD3_CMD}
  - {pin_num: C13, peripheral: uSDHC3, signal: dat5, pin_signal: SD3_DAT5}
  - {pin_num: D13, peripheral: uSDHC3, signal: dat4, pin_signal: SD3_DAT4}
  - {pin_num: E13, peripheral: uSDHC3, signal: dat6, pin_signal: SD3_DAT6}
  - {pin_num: F13, peripheral: uSDHC3, signal: dat7, pin_signal: SD3_DAT7}
  - {pin_num: D14, peripheral: uSDHC3, signal: clk, pin_signal: SD3_CLK}
  - {pin_num: E14, peripheral: uSDHC3, signal: dat0, pin_signal: SD3_DAT0}
  - {pin_num: F14, peripheral: uSDHC3, signal: dat1, pin_signal: SD3_DAT1}
  - {pin_num: A15, peripheral: uSDHC3, signal: dat2, pin_signal: SD3_DAT2}
  - {pin_num: B15, peripheral: uSDHC3, signal: dat3, pin_signal: SD3_DAT3}
  - {pin_num: D15, peripheral: uSDHC3, signal: rst, pin_signal: SD3_RST}
  - {pin_num: AD2, peripheral: MMDC, signal: 'dram_d, 0', pin_signal: DRAM_D0}
  - {pin_num: AE2, peripheral: MMDC, signal: 'dram_d, 1', pin_signal: DRAM_D1}
  - {pin_num: AC3, peripheral: MMDC, signal: 'dram_dqm, 0', pin_signal: DRAM_DQM0}
  - {pin_num: AD3, peripheral: MMDC, signal: 'dram_sdqs_b, 0', pin_signal: DRAM_SDQS0_B}
  - {pin_num: AE3, peripheral: MMDC, signal: 'dram_sdqs, 0', pin_signal: DRAM_SDQS0}
  - {pin_num: AB4, peripheral: MMDC, signal: 'dram_d, 6', pin_signal: DRAM_D6}
  - {pin_num: AC4, peripheral: MMDC, signal: 'dram_d, 2', pin_signal: DRAM_D2}
  - {pin_num: AE4, peripheral: MMDC, signal: 'dram_d, 7', pin_signal: DRAM_D7}
  - {pin_num: AC1, peripheral: MMDC, signal: 'dram_d, 4', pin_signal: DRAM_D4}
  - {pin_num: AD1, peripheral: MMDC, signal: 'dram_d, 5', pin_signal: DRAM_D5}
  - {pin_num: AA5, peripheral: MMDC, signal: 'dram_d, 3', pin_signal: DRAM_D3}
  - {pin_num: AB5, peripheral: MMDC, signal: 'dram_d, 12', pin_signal: DRAM_D12}
  - {pin_num: AC5, peripheral: MMDC, signal: 'dram_d, 13', pin_signal: DRAM_D13}
  - {pin_num: AD5, peripheral: MMDC, signal: 'dram_d, 8', pin_signal: DRAM_D8}
  - {pin_num: AE5, peripheral: MMDC, signal: 'dram_d, 9', pin_signal: DRAM_D9}
  - {pin_num: Y6, peripheral: MMDC, signal: dram_reset, pin_signal: DRAM_RESET}
  - {pin_num: AA6, peripheral: MMDC, signal: 'dram_d, 10', pin_signal: DRAM_D10}
  - {pin_num: AB6, peripheral: MMDC, signal: 'dram_d, 14', pin_signal: DRAM_D14}
  - {pin_num: AC6, peripheral: MMDC, signal: 'dram_dqm, 1', pin_signal: DRAM_DQM1}
  - {pin_num: AD6, peripheral: MMDC, signal: 'dram_sdqs, 1', pin_signal: DRAM_SDQS1}
  - {pin_num: AE6, peripheral: MMDC, signal: 'dram_sdqs_b, 1', pin_signal: DRAM_SDQS1_B}
  - {pin_num: Y7, peripheral: MMDC, signal: 'dram_d, 20', pin_signal: DRAM_D20}
  - {pin_num: AB7, peripheral: MMDC, signal: 'dram_d, 16', pin_signal: DRAM_D16}
  - {pin_num: AC7, peripheral: MMDC, signal: 'dram_d, 15', pin_signal: DRAM_D15}
  - {pin_num: AE7, peripheral: MMDC, signal: 'dram_d, 11', pin_signal: DRAM_D11}
  - {pin_num: Y8, peripheral: MMDC, signal: 'dram_d, 21', pin_signal: DRAM_D21}
  - {pin_num: AA8, peripheral: MMDC, signal: 'dram_d, 17', pin_signal: DRAM_D17}
  - {pin_num: AB8, peripheral: MMDC, signal: 'dram_dqm, 2', pin_signal: DRAM_DQM2}
  - {pin_num: AC8, peripheral: MMDC, signal: 'dram_d, 22', pin_signal: DRAM_D22}
  - {pin_num: AD8, peripheral: MMDC, signal: 'dram_sdqs, 2', pin_signal: DRAM_SDQS2}
  - {pin_num: AE8, peripheral: MMDC, signal: 'dram_sdqs_b, 2', pin_signal: DRAM_SDQS2_B}
  - {pin_num: Y9, peripheral: MMDC, signal: 'dram_d, 19', pin_signal: DRAM_D19}
  - {pin_num: AA9, peripheral: MMDC, signal: 'dram_d, 23', pin_signal: DRAM_D23}
  - {pin_num: AB9, peripheral: MMDC, signal: 'dram_d, 18', pin_signal: DRAM_D18}
  - {pin_num: AC9, peripheral: MMDC, signal: 'dram_d, 28', pin_signal: DRAM_D28}
  - {pin_num: AD9, peripheral: MMDC, signal: 'dram_d, 29', pin_signal: DRAM_D29}
  - {pin_num: AE9, peripheral: MMDC, signal: 'dram_d, 24', pin_signal: DRAM_D24}
  - {pin_num: Y10, peripheral: MMDC, signal: 'dram_d, 25', pin_signal: DRAM_D25}
  - {pin_num: AB10, peripheral: MMDC, signal: 'dram_sdqs_b, 3', pin_signal: DRAM_SDQS3_B}
  - {pin_num: AC10, peripheral: MMDC, signal: 'dram_sdqs, 3', pin_signal: DRAM_SDQS3}
  - {pin_num: AE10, peripheral: MMDC, signal: 'dram_dqm, 3', pin_signal: DRAM_DQM3}
  - {pin_num: Y11, peripheral: MMDC, signal: 'dram_sdcke, 0', pin_signal: DRAM_SDCKE0}
  - {pin_num: AA11, peripheral: MMDC, signal: 'dram_sdcke, 1', pin_signal: DRAM_SDCKE1}
  - {pin_num: AB11, peripheral: MMDC, signal: 'dram_d, 27', pin_signal: DRAM_D27}
  - {pin_num: AC11, peripheral: MMDC, signal: 'dram_d, 31', pin_signal: DRAM_D31}
  - {pin_num: AD11, peripheral: MMDC, signal: 'dram_d, 30', pin_signal: DRAM_D30}
  - {pin_num: AE11, peripheral: MMDC, signal: 'dram_d, 26', pin_signal: DRAM_D26}
  - {pin_num: Y12, peripheral: MMDC, signal: 'dram_a, 15', pin_signal: DRAM_A15}
  - {pin_num: AA12, peripheral: MMDC, signal: 'dram_a, 14', pin_signal: DRAM_A14}
  - {pin_num: AB12, peripheral: MMDC, signal: 'dram_sdba, 2', pin_signal: DRAM_SDBA2}
  - {pin_num: AC12, peripheral: MMDC, signal: 'dram_a, 11', pin_signal: DRAM_A11}
  - {pin_num: AD12, peripheral: MMDC, signal: 'dram_a, 12', pin_signal: DRAM_A12}
  - {pin_num: AE12, peripheral: MMDC, signal: 'dram_a, 9', pin_signal: DRAM_A9}
  - {pin_num: Y13, peripheral: MMDC, signal: 'dram_a, 7', pin_signal: DRAM_A7}
  - {pin_num: AB13, peripheral: MMDC, signal: 'dram_a, 8', pin_signal: DRAM_A8}
  - {pin_num: AC13, peripheral: MMDC, signal: 'dram_a, 6', pin_signal: DRAM_A6}
  - {pin_num: AE13, peripheral: MMDC, signal: 'dram_a, 5', pin_signal: DRAM_A5}
  - {pin_num: W14, peripheral: MMDC, signal: 'dram_a, 4', pin_signal: DRAM_A4}
  - {pin_num: Y14, peripheral: MMDC, signal: 'dram_a, 3', pin_signal: DRAM_A3}
  - {pin_num: AA14, peripheral: MMDC, signal: 'dram_a, 2', pin_signal: DRAM_A2}
  - {pin_num: AB14, peripheral: MMDC, signal: 'dram_a, 1', pin_signal: DRAM_A1}
  - {pin_num: AC14, peripheral: MMDC, signal: 'dram_a, 0', pin_signal: DRAM_A0}
  - {pin_num: AD14, peripheral: MMDC, signal: dram_sdclk_1, pin_signal: DRAM_SDCLK_1}
  - {pin_num: AE14, peripheral: MMDC, signal: dram_sdclk_1_b, pin_signal: DRAM_SDCLK_1_B}
  - {pin_num: Y15, peripheral: MMDC, signal: 'dram_sdba, 1', pin_signal: DRAM_SDBA1}
  - {pin_num: AA15, peripheral: MMDC, signal: 'dram_a, 10', pin_signal: DRAM_A10}
  - {pin_num: AB15, peripheral: MMDC, signal: dram_ras, pin_signal: DRAM_RAS}
  - {pin_num: AC15, peripheral: MMDC, signal: 'dram_sdba, 0', pin_signal: DRAM_SDBA0}
  - {pin_num: AD15, peripheral: MMDC, signal: dram_sdclk_0, pin_signal: DRAM_SDCLK_0}
  - {pin_num: AE15, peripheral: MMDC, signal: dram_sdclk_0_b, pin_signal: DRAM_SDCLK_0_B}
  - {pin_num: Y16, peripheral: MMDC, signal: 'dram_cs, 0', pin_signal: DRAM_CS0}
  - {pin_num: AB16, peripheral: MMDC, signal: dram_sdwe, pin_signal: DRAM_SDWE}
  - {pin_num: AC16, peripheral: MMDC, signal: 'dram_odt, 0', pin_signal: DRAM_SDODT0}
  - {pin_num: AE16, peripheral: MMDC, signal: dram_cas, pin_signal: DRAM_CAS}
  - {pin_num: Y17, peripheral: MMDC, signal: 'dram_d, 36', pin_signal: DRAM_D36}
  - {pin_num: AA17, peripheral: MMDC, signal: 'dram_d, 32', pin_signal: DRAM_D32}
  - {pin_num: AC17, peripheral: MMDC, signal: 'dram_a, 13', pin_signal: DRAM_A13}
  - {pin_num: Y18, peripheral: MMDC, signal: 'dram_d, 37', pin_signal: DRAM_D37}
  - {pin_num: AA18, peripheral: MMDC, signal: 'dram_d, 33', pin_signal: DRAM_D33}
  - {pin_num: AB18, peripheral: MMDC, signal: 'dram_dqm, 4', pin_signal: DRAM_DQM4}
  - {pin_num: AC18, peripheral: MMDC, signal: 'dram_d, 34', pin_signal: DRAM_D34}
  - {pin_num: AD18, peripheral: MMDC, signal: 'dram_sdqs, 4', pin_signal: DRAM_SDQS4}
  - {pin_num: AE18, peripheral: MMDC, signal: 'dram_sdqs_b, 4', pin_signal: DRAM_SDQS4_B}
  - {pin_num: Y19, peripheral: MMDC, signal: 'dram_d, 40', pin_signal: DRAM_D40}
  - {pin_num: AB19, peripheral: MMDC, signal: 'dram_d, 38', pin_signal: DRAM_D38}
  - {pin_num: AC19, peripheral: MMDC, signal: 'dram_d, 39', pin_signal: DRAM_D39}
  - {pin_num: AE19, peripheral: MMDC, signal: 'dram_d, 35', pin_signal: DRAM_D35}
  - {pin_num: Y20, peripheral: MMDC, signal: 'dram_d, 44', pin_signal: DRAM_D44}
  - {pin_num: AA20, peripheral: MMDC, signal: 'dram_d, 45', pin_signal: DRAM_D45}
  - {pin_num: AB20, peripheral: MMDC, signal: 'dram_d, 41', pin_signal: DRAM_D41}
  - {pin_num: AC20, peripheral: MMDC, signal: 'dram_dqm, 5', pin_signal: DRAM_DQM5}
  - {pin_num: AD20, peripheral: MMDC, signal: 'dram_sdqs, 5', pin_signal: DRAM_SDQS5}
  - {pin_num: AE20, peripheral: MMDC, signal: 'dram_sdqs_b, 5', pin_signal: DRAM_SDQS5_B}
  - {pin_num: Y21, peripheral: MMDC, signal: 'dram_dqm, 7', pin_signal: DRAM_DQM7}
  - {pin_num: AA21, peripheral: MMDC, signal: 'dram_d, 57', pin_signal: DRAM_D57}
  - {pin_num: AB21, peripheral: MMDC, signal: 'dram_d, 42', pin_signal: DRAM_D42}
