ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.c
  - {pin_num: AC21, peripheral: MMDC, signal: 'dram_d, 47', pin_signal: DRAM_D47}
  - {pin_num: AD21, peripheral: MMDC, signal: 'dram_d, 43', pin_signal: DRAM_D43}
  - {pin_num: AE21, peripheral: MMDC, signal: 'dram_d, 46', pin_signal: DRAM_D46}
  - {pin_num: Y22, peripheral: MMDC, signal: 'dram_d, 59', pin_signal: DRAM_D59}
  - {pin_num: AB22, peripheral: MMDC, signal: 'dram_d, 52', pin_signal: DRAM_D52}
  - {pin_num: AC22, peripheral: MMDC, signal: 'dram_d, 48', pin_signal: DRAM_D48}
  - {pin_num: AE22, peripheral: MMDC, signal: 'dram_d, 49', pin_signal: DRAM_D49}
  - {pin_num: Y23, peripheral: MMDC, signal: 'dram_d, 62', pin_signal: DRAM_D62}
  - {pin_num: AA23, peripheral: MMDC, signal: 'dram_d, 61', pin_signal: DRAM_D61}
  - {pin_num: AB23, peripheral: MMDC, signal: 'dram_d, 60', pin_signal: DRAM_D60}
  - {pin_num: AC23, peripheral: MMDC, signal: 'dram_d, 53', pin_signal: DRAM_D53}
  - {pin_num: AD23, peripheral: MMDC, signal: 'dram_sdqs, 6', pin_signal: DRAM_SDQS6}
  - {pin_num: AE23, peripheral: MMDC, signal: 'dram_sdqs_b, 6', pin_signal: DRAM_SDQS6_B}
  - {pin_num: AA24, peripheral: MMDC, signal: 'dram_sdqs_b, 7', pin_signal: DRAM_SDQS7_B}
  - {pin_num: AC24, peripheral: MMDC, signal: 'dram_d, 51', pin_signal: DRAM_D51}
  - {pin_num: AD24, peripheral: MMDC, signal: 'dram_dqm, 6', pin_signal: DRAM_DQM6}
  - {pin_num: AE24, peripheral: MMDC, signal: 'dram_d, 50', pin_signal: DRAM_D50}
  - {pin_num: W25, peripheral: MMDC, signal: 'dram_d, 63', pin_signal: DRAM_D63}
  - {pin_num: Y25, peripheral: MMDC, signal: 'dram_d, 58', pin_signal: DRAM_D58}
  - {pin_num: AA25, peripheral: MMDC, signal: 'dram_sdqs, 7', pin_signal: DRAM_SDQS7}
  - {pin_num: AC25, peripheral: MMDC, signal: 'dram_d, 55', pin_signal: DRAM_D55}
  - {pin_num: AB25, peripheral: MMDC, signal: 'dram_d, 56', pin_signal: DRAM_D56}
  - {pin_num: AD25, peripheral: MMDC, signal: 'dram_d, 54', pin_signal: DRAM_D54}
  - {pin_num: G16, peripheral: PMU, signal: nvcc_sd1, pin_signal: NVCC_SD1}
  - {pin_num: H16, peripheral: PMU, signal: 'vdd_soc_in, 0', pin_signal: VDDSOC_IN0}
  - {pin_num: J16, peripheral: PMU, signal: 'vdd_soc_in, 1', pin_signal: VDDSOC_IN1}
  - {pin_num: K16, peripheral: PMU, signal: 'vdd_soc_in, 2', pin_signal: VDDSOC_IN2}
  - {pin_num: U16, peripheral: PMU, signal: 'vdd_soc_in, 9', pin_signal: VDDSOC_IN9}
  - {pin_num: T16, peripheral: PMU, signal: 'vdd_soc_in, 8', pin_signal: VDDSOC_IN8}
  - {pin_num: R16, peripheral: PMU, signal: 'vdd_soc_in, 7', pin_signal: VDDSOC_IN7}
  - {pin_num: P16, peripheral: PMU, signal: 'vdd_soc_in, 6', pin_signal: VDDSOC_IN6}
  - {pin_num: N16, peripheral: PMU, signal: 'vdd_soc_in, 5', pin_signal: VDDSOC_IN5}
  - {pin_num: M16, peripheral: PMU, signal: 'vdd_soc_in, 4', pin_signal: VDDSOC_IN4}
  - {pin_num: L16, peripheral: PMU, signal: 'vdd_soc_in, 3', pin_signal: VDDSOC_IN3}
  - {pin_num: V16, peripheral: PMU, signal: 'nvcc_dram, 10', pin_signal: NVCC_DRAM10}
  - {pin_num: W16, peripheral: PMU, signal: 'gnd, 84', pin_signal: GND84}
  - {pin_num: AA16, peripheral: PMU, signal: 'gnd, 93', pin_signal: GND93}
  - {pin_num: C1, peripheral: PMU, signal: 'gnd, 5', pin_signal: GND5}
  - {pin_num: AE1, peripheral: PMU, signal: 'gnd, 105', pin_signal: GND105}
  - {pin_num: G5, peripheral: SJC, signal: tdi, pin_signal: JTAG_TDI}
  - {pin_num: G6, peripheral: SJC, signal: tdo, pin_signal: JTAG_TDO}
  - {pin_num: H6, peripheral: SJC, signal: mod, pin_signal: JTAG_MOD}
  - {pin_num: J2, peripheral: PMU, signal: 'gnd, 26', pin_signal: GND26}
  - {pin_num: L2, peripheral: PMU, signal: 'gnd, 36', pin_signal: GND36}
  - {pin_num: AC2, peripheral: PMU, signal: dram_vref, pin_signal: DRAM_VREF}
  - {pin_num: D3, peripheral: PMU, signal: 'gnd, 9', pin_signal: GND9}
  - {pin_num: G3, peripheral: PMU, signal: 'gnd, 19', pin_signal: GND19}
  - {pin_num: W3, peripheral: PMU, signal: 'gnd, 75', pin_signal: GND75}
  - {pin_num: AB3, peripheral: PMU, signal: 'gnd, 96', pin_signal: GND96}
  - {pin_num: A4, peripheral: PMU, signal: 'gnd, 0', pin_signal: GND0}
  - {pin_num: B4, peripheral: PMU, signal: 'gnd, 4', pin_signal: GND4}
  - {pin_num: C4, peripheral: PMU, signal: 'gnd, 6', pin_signal: GND6}
  - {pin_num: AD4, peripheral: PMU, signal: 'gnd, 98', pin_signal: GND98}
  - {pin_num: E5, peripheral: PMU, signal: 'gnd, 12', pin_signal: GND12}
  - {pin_num: F5, peripheral: PMU, signal: 'gnd, 15', pin_signal: GND15}
  - {pin_num: L5, peripheral: PMU, signal: 'gnd, 37', pin_signal: GND37}
  - {pin_num: U5, peripheral: I2C2, signal: scl, pin_signal: KEY_COL3}
  - {pin_num: Y5, peripheral: PMU, signal: 'gnd, 88', pin_signal: GND88}
  - {pin_num: C6, peripheral: PMU, signal: 'gnd, 7', pin_signal: GND7}
  - {pin_num: D6, peripheral: PMU, signal: 'gnd, 10', pin_signal: GND10}
  - {pin_num: E6, peripheral: PMU, signal: 'gnd, 13', pin_signal: GND13}
  - {pin_num: F6, peripheral: PMU, signal: 'gnd, 16', pin_signal: GND16}
  - {pin_num: A7, peripheral: XTALOSC, signal: xtali, pin_signal: XTALI}
  - {pin_num: B7, peripheral: XTALOSC, signal: xtalo, pin_signal: XTALO}
  - {pin_num: E7, peripheral: PMU, signal: 'gnd, 14', pin_signal: GND14}
  - {pin_num: F7, peripheral: PMU, signal: 'gnd, 17', pin_signal: GND17}
  - {pin_num: J7, peripheral: PMU, signal: nvcc_jtag, pin_signal: NVCC_JTAG}
  - {pin_num: K7, peripheral: PMU, signal: nvcc_mipi, pin_signal: NVCC_MIPI}
  - {pin_num: N7, peripheral: PMU, signal: nvcc_csi, pin_signal: NVCC_CSI}
  - {pin_num: P7, peripheral: PMU, signal: nvcc_gpio, pin_signal: NVCC_GPIO}
  - {pin_num: T7, peripheral: I2C2, signal: sda, pin_signal: KEY_ROW3}
  - {pin_num: V7, peripheral: PMU, signal: nvcc_lvds2p5, pin_signal: NVCC_LVDS2P5}
  - {pin_num: W7, peripheral: PMU, signal: 'gnd, 76', pin_signal: GND76}
  - {pin_num: AA7, peripheral: PMU, signal: 'gnd, 90', pin_signal: GND90}
  - {pin_num: AD7, peripheral: PMU, signal: 'gnd, 99', pin_signal: GND99}
  - {pin_num: A8, peripheral: PMU, signal: 'gnd, 1', pin_signal: GND1}
  - {pin_num: D8, peripheral: PMU, signal: 'gnd, 11', pin_signal: GND11}
  - {pin_num: F8, peripheral: PMU, signal: 'gnd, 18', pin_signal: GND18}
  - {pin_num: H8, peripheral: PMU, signal: 'gnd, 22', pin_signal: GND22}
  - {pin_num: J8, peripheral: PMU, signal: 'gnd, 27', pin_signal: GND27}
  - {pin_num: K8, peripheral: PMU, signal: 'gnd, 31', pin_signal: GND31}
  - {pin_num: L8, peripheral: PMU, signal: 'gnd, 38', pin_signal: GND38}
  - {pin_num: M8, peripheral: PMU, signal: 'gnd, 43', pin_signal: GND43}
  - {pin_num: N8, peripheral: PMU, signal: 'gnd, 48', pin_signal: GND48}
  - {pin_num: P8, peripheral: PMU, signal: 'gnd, 52', pin_signal: GND52}
  - {pin_num: R8, peripheral: PMU, signal: 'gnd, 57', pin_signal: GND57}
  - {pin_num: T8, peripheral: PMU, signal: 'gnd, 61', pin_signal: GND61}
  - {pin_num: U8, peripheral: PMU, signal: 'gnd, 67', pin_signal: GND67}
  - {pin_num: V8, peripheral: PMU, signal: 'gnd, 73', pin_signal: GND73}
  - {pin_num: W8, peripheral: PMU, signal: 'gnd, 77', pin_signal: GND77}
  - {pin_num: E8, peripheral: PMU, signal: nvcc_pll_out, pin_signal: NVCC_PLL_OUT}
  - {pin_num: E9, peripheral: PMU, signal: usb_otg_vbus, pin_signal: USB_OTG_VBUS}
  - {pin_num: F9, peripheral: PMU, signal: vdd_usb_cap, pin_signal: VDDUSB_CAP}
  - {pin_num: G9, peripheral: PMU, signal: vdd_snvs_cap, pin_signal: VDD_SNVS_CAP}
  - {pin_num: H9, peripheral: PMU, signal: 'vdd_high_in, 0', pin_signal: VDDHIGH_IN0}
  - {pin_num: J9, peripheral: PMU, signal: 'vdd_high_in, 1', pin_signal: VDDHIGH_IN1}
  - {pin_num: K9, peripheral: PMU, signal: 'vdd_arm23_in, 0', pin_signal: VDDARM23_IN0}
  - {pin_num: L9, peripheral: PMU, signal: 'vdd_arm23_in, 1', pin_signal: VDDARM23_IN1}
  - {pin_num: M9, peripheral: PMU, signal: 'vdd_arm23_in, 2', pin_signal: VDDARM23_IN2}
  - {pin_num: N9, peripheral: PMU, signal: 'vdd_arm23_in, 3', pin_signal: VDDARM23_IN3}
  - {pin_num: P9, peripheral: PMU, signal: 'vdd_arm23_in, 4', pin_signal: VDDARM23_IN4}
  - {pin_num: R9, peripheral: PMU, signal: 'vdd_arm23_in, 5', pin_signal: VDDARM23_IN5}
  - {pin_num: T9, peripheral: PMU, signal: 'vdd_arm23_in, 6', pin_signal: VDDARM23_IN6}
  - {pin_num: U9, peripheral: PMU, signal: 'vdd_arm23_in, 7', pin_signal: VDDARM23_IN7}
  - {pin_num: V9, peripheral: PMU, signal: 'nvcc_dram, 3', pin_signal: NVCC_DRAM3}
  - {pin_num: W9, peripheral: PMU, signal: 'gnd, 78', pin_signal: GND78}
  - {pin_num: C10, peripheral: PMU, signal: 'gnd, 8', pin_signal: GND8}
  - {pin_num: G10, peripheral: PMU, signal: 'gnd, 20', pin_signal: GND20}
  - {pin_num: K10, peripheral: PMU, signal: 'gnd, 32', pin_signal: GND32}
  - {pin_num: L10, peripheral: PMU, signal: 'gnd, 39', pin_signal: GND39}
  - {pin_num: H10, peripheral: PMU, signal: 'vdd_high_cap, 0', pin_signal: VDDHIGH_CAP0}
  - {pin_num: J10, peripheral: PMU, signal: 'vdd_high_cap, 1', pin_signal: VDDHIGH_CAP1}
  - {pin_num: M10, peripheral: PMU, signal: 'gnd, 44', pin_signal: GND44}
  - {pin_num: N10, peripheral: PMU, signal: 'gnd, 49', pin_signal: GND49}
  - {pin_num: P10, peripheral: PMU, signal: 'gnd, 53', pin_signal: GND53}
  - {pin_num: W10, peripheral: PMU, signal: 'gnd, 79', pin_signal: GND79}
  - {pin_num: R10, peripheral: PMU, signal: 'vdd_soc_cap, 0', pin_signal: VDDSOC_CAP0}
  - {pin_num: T10, peripheral: PMU, signal: 'vdd_soc_cap, 1', pin_signal: VDDSOC_CAP1}
  - {pin_num: U10, peripheral: PMU, signal: 'vdd_soc_cap, 4', pin_signal: VDDSOC_CAP4}
  - {pin_num: V10, peripheral: PMU, signal: 'nvcc_dram, 4', pin_signal: NVCC_DRAM4}
  - {pin_num: AA10, peripheral: PMU, signal: 'gnd, 91', pin_signal: GND91}
  - {pin_num: AD10, peripheral: PMU, signal: 'gnd, 100', pin_signal: GND100}
  - {pin_num: C11, peripheral: SRC, signal: por_b, pin_signal: POR_B}
  - {pin_num: D11, peripheral: SNVS, signal: snvs_wakeup_alarm, pin_signal: PMIC_ON_REQ}
  - {pin_num: F11, peripheral: CCM, signal: pmic_vstby_req, pin_signal: PMIC_STBY_REQ}
  - {pin_num: G11, peripheral: PMU, signal: vdd_snvs_in, pin_signal: VDD_SNVS_IN}
  - {pin_num: H11, peripheral: PMU, signal: 'vdd_arm23_cap, 0', pin_signal: VDDARM23_CAP0}
  - {pin_num: J11, peripheral: PMU, signal: 'vdd_arm23_cap, 1', pin_signal: VDDARM23_CAP1}
  - {pin_num: K11, peripheral: PMU, signal: 'vdd_arm23_cap, 2', pin_signal: VDDARM23_CAP2}
  - {pin_num: L11, peripheral: PMU, signal: 'vdd_arm23_cap, 3', pin_signal: VDDARM23_CAP3}
  - {pin_num: M11, peripheral: PMU, signal: 'vdd_arm23_cap, 4', pin_signal: VDDARM23_CAP4}
  - {pin_num: N11, peripheral: PMU, signal: 'vdd_arm23_cap, 5', pin_signal: VDDARM23_CAP5}
  - {pin_num: P11, peripheral: PMU, signal: 'vdd_arm23_cap, 6', pin_signal: VDDARM23_CAP6}
  - {pin_num: R11, peripheral: PMU, signal: 'vdd_arm23_cap, 7', pin_signal: VDDARM23_CAP7}
  - {pin_num: T11, peripheral: PMU, signal: 'gnd, 62', pin_signal: GND62}
  - {pin_num: U11, peripheral: PMU, signal: 'gnd, 68', pin_signal: GND68}
  - {pin_num: V11, peripheral: PMU, signal: 'nvcc_dram, 5', pin_signal: NVCC_DRAM5}
  - {pin_num: W11, peripheral: PMU, signal: 'gnd, 80', pin_signal: GND80}
  - {pin_num: C12, peripheral: SRC, signal: boot_mode0, pin_signal: BOOT_MODE0}
  - {pin_num: F12, peripheral: SRC, signal: boot_mode1, pin_signal: BOOT_MODE1}
  - {pin_num: H12, peripheral: PMU, signal: 'gnd, 23', pin_signal: GND23}
  - {pin_num: J12, peripheral: PMU, signal: 'gnd, 28', pin_signal: GND28}
  - {pin_num: K12, peripheral: PMU, signal: 'gnd, 33', pin_signal: GND33}
  - {pin_num: L12, peripheral: PMU, signal: 'gnd, 40', pin_signal: GND40}
  - {pin_num: M12, peripheral: PMU, signal: 'gnd, 45', pin_signal: GND45}
  - {pin_num: P12, peripheral: PMU, signal: 'gnd, 54', pin_signal: GND54}
  - {pin_num: R12, peripheral: PMU, signal: 'gnd, 58', pin_signal: GND58}
  - {pin_num: T12, peripheral: PMU, signal: 'gnd, 63', pin_signal: GND63}
  - {pin_num: U12, peripheral: PMU, signal: 'gnd, 69', pin_signal: GND69}
  - {pin_num: N12, peripheral: PMU, signal: vdd_cache_cap, pin_signal: VDD_CACHE_CAP}
  - {pin_num: W12, peripheral: PMU, signal: 'gnd, 81', pin_signal: GND81}
  - {pin_num: V12, peripheral: PMU, signal: 'nvcc_dram, 6', pin_signal: NVCC_DRAM6}
  - {pin_num: A13, peripheral: PMU, signal: 'gnd, 2', pin_signal: GND2}
  - {pin_num: H13, peripheral: PMU, signal: 'vdd_arm_cap, 0', pin_signal: VDDARM_CAP0}
  - {pin_num: J13, peripheral: PMU, signal: 'vdd_arm_cap, 1', pin_signal: VDDARM_CAP1}
  - {pin_num: K13, peripheral: PMU, signal: 'vdd_arm_cap, 2', pin_signal: VDDARM_CAP2}
  - {pin_num: L13, peripheral: PMU, signal: 'vdd_arm_cap, 3', pin_signal: VDDARM_CAP3}
  - {pin_num: M13, peripheral: PMU, signal: 'vdd_arm_cap, 4', pin_signal: VDDARM_CAP4}
  - {pin_num: N13, peripheral: PMU, signal: 'vdd_arm_cap, 5', pin_signal: VDDARM_CAP5}
  - {pin_num: P13, peripheral: PMU, signal: 'vdd_arm_cap, 6', pin_signal: VDDARM_CAP6}
  - {pin_num: W13, peripheral: PMU, signal: 'gnd, 82', pin_signal: GND82}
  - {pin_num: R13, peripheral: PMU, signal: 'vdd_arm_cap, 7', pin_signal: VDDARM_CAP7}
  - {pin_num: AA13, peripheral: PMU, signal: 'gnd, 92', pin_signal: GND92}
  - {pin_num: T13, peripheral: PMU, signal: 'vdd_soc_cap, 2', pin_signal: VDDSOC_CAP2}
  - {pin_num: U13, peripheral: PMU, signal: 'vdd_soc_cap, 5', pin_signal: VDDSOC_CAP5}
  - {pin_num: V13, peripheral: PMU, signal: 'nvcc_dram, 7', pin_signal: NVCC_DRAM7}
  - {pin_num: AD13, peripheral: PMU, signal: 'gnd, 101', pin_signal: GND101}
  - {pin_num: G14, peripheral: PMU, signal: nvcc_sd3, pin_signal: NVCC_SD3}
  - {pin_num: H14, peripheral: PMU, signal: 'vdd_arm_in, 0', pin_signal: VDDARM_IN0}
  - {pin_num: J14, peripheral: PMU, signal: 'vdd_arm_in, 1', pin_signal: VDDARM_IN1}
  - {pin_num: K14, peripheral: PMU, signal: 'vdd_arm_in, 2', pin_signal: VDDARM_IN2}
  - {pin_num: L14, peripheral: PMU, signal: 'vdd_arm_in, 3', pin_signal: VDDARM_IN3}
  - {pin_num: M14, peripheral: PMU, signal: 'vdd_arm_in, 4', pin_signal: VDDARM_IN4}
  - {pin_num: N14, peripheral: PMU, signal: 'vdd_arm_in, 5', pin_signal: VDDARM_IN5}
  - {pin_num: P14, peripheral: PMU, signal: 'vdd_arm_in, 6', pin_signal: VDDARM_IN6}
  - {pin_num: R14, peripheral: PMU, signal: 'vdd_arm_in, 7', pin_signal: VDDARM_IN7}
  - {pin_num: T14, peripheral: PMU, signal: 'vdd_soc_cap, 3', pin_signal: VDDSOC_CAP3}
  - {pin_num: U14, peripheral: PMU, signal: 'vdd_soc_cap, 6', pin_signal: VDDSOC_CAP6}
  - {pin_num: V14, peripheral: PMU, signal: 'nvcc_dram, 8', pin_signal: NVCC_DRAM8}
  - {pin_num: H15, peripheral: PMU, signal: 'gnd, 24', pin_signal: GND24}
  - {pin_num: J15, peripheral: PMU, signal: 'gnd, 29', pin_signal: GND29}
  - {pin_num: K15, peripheral: PMU, signal: 'gnd, 34', pin_signal: GND34}
  - {pin_num: L15, peripheral: PMU, signal: 'gnd, 41', pin_signal: GND41}
  - {pin_num: M15, peripheral: PMU, signal: 'gnd, 46', pin_signal: GND46}
  - {pin_num: N15, peripheral: PMU, signal: 'gnd, 50', pin_signal: GND50}
  - {pin_num: P15, peripheral: PMU, signal: 'gnd, 55', pin_signal: GND55}
  - {pin_num: R15, peripheral: PMU, signal: 'gnd, 59', pin_signal: GND59}
  - {pin_num: T15, peripheral: PMU, signal: 'gnd, 64', pin_signal: GND64}
  - {pin_num: U15, peripheral: PMU, signal: 'gnd, 70', pin_signal: GND70}
  - {pin_num: G15, peripheral: PMU, signal: nvcc_nand, pin_signal: NVCC_NANDF}
  - {pin_num: V15, peripheral: PMU, signal: 'nvcc_dram, 9', pin_signal: NVCC_DRAM9}
  - {pin_num: W15, peripheral: PMU, signal: 'gnd, 83', pin_signal: GND83}
  - {pin_num: AD16, peripheral: PMU, signal: 'gnd, 102', pin_signal: GND102}
  - {pin_num: G17, peripheral: PMU, signal: nvcc_sd2, pin_signal: NVCC_SD2}
  - {pin_num: H17, peripheral: PMU, signal: 'vdd_pu_cap, 0', pin_signal: VDDPU_CAP0}
  - {pin_num: J17, peripheral: PMU, signal: 'vdd_pu_cap, 1', pin_signal: VDDPU_CAP1}
  - {pin_num: K17, peripheral: PMU, signal: 'vdd_pu_cap, 2', pin_signal: VDDPU_CAP2}
  - {pin_num: L17, peripheral: PMU, signal: 'vdd_pu_cap, 3', pin_signal: VDDPU_CAP3}
  - {pin_num: M17, peripheral: PMU, signal: 'vdd_pu_cap, 4', pin_signal: VDDPU_CAP4}
  - {pin_num: N17, peripheral: PMU, signal: 'vdd_pu_cap, 5', pin_signal: VDDPU_CAP5}
  - {pin_num: P17, peripheral: PMU, signal: 'vdd_pu_cap, 6', pin_signal: VDDPU_CAP6}
  - {pin_num: R17, peripheral: PMU, signal: 'gnd, 60', pin_signal: GND60}
  - {pin_num: T17, peripheral: PMU, signal: 'gnd, 65', pin_signal: GND65}
  - {pin_num: U17, peripheral: PMU, signal: 'gnd, 71', pin_signal: GND71}
  - {pin_num: W17, peripheral: PMU, signal: 'gnd, 85', pin_signal: GND85}
  - {pin_num: V17, peripheral: PMU, signal: 'nvcc_dram, 11', pin_signal: NVCC_DRAM11}
  - {pin_num: AE17, peripheral: PMU, signal: zqpad, pin_signal: ZQPAD}
  - {pin_num: H18, peripheral: PMU, signal: 'gnd, 25', pin_signal: GND25}
  - {pin_num: J18, peripheral: PMU, signal: 'gnd, 30', pin_signal: GND30}
  - {pin_num: K18, peripheral: PMU, signal: 'gnd, 35', pin_signal: GND35}
  - {pin_num: L18, peripheral: PMU, signal: 'gnd, 42', pin_signal: GND42}
  - {pin_num: M18, peripheral: PMU, signal: 'gnd, 47', pin_signal: GND47}
  - {pin_num: G18, peripheral: PMU, signal: nvcc_rgmii, pin_signal: NVCC_RGMII}
  - {pin_num: N18, peripheral: PMU, signal: 'gnd, 51', pin_signal: GND51}
  - {pin_num: P18, peripheral: PMU, signal: 'gnd, 56', pin_signal: GND56}
  - {pin_num: R18, peripheral: PMU, signal: 'nvcc_dram, 0', pin_signal: NVCC_DRAM0}
  - {pin_num: T18, peripheral: PMU, signal: 'nvcc_dram, 1', pin_signal: NVCC_DRAM1}
  - {pin_num: U18, peripheral: PMU, signal: 'nvcc_dram, 2', pin_signal: NVCC_DRAM2}
  - {pin_num: V18, peripheral: PMU, signal: 'nvcc_dram, 12', pin_signal: NVCC_DRAM12}
  - {pin_num: W18, peripheral: PMU, signal: 'gnd, 86', pin_signal: GND86}
  - {pin_num: G19, peripheral: PMU, signal: 'gnd, 21', pin_signal: GND21}
  - {pin_num: K19, peripheral: PMU, signal: nvcc_eim0, pin_signal: NVCC_EIM0}
  - {pin_num: T19, peripheral: PMU, signal: 'gnd, 66', pin_signal: GND66}
  - {pin_num: U19, peripheral: PMU, signal: 'gnd, 72', pin_signal: GND72}
  - {pin_num: V19, peripheral: PMU, signal: 'gnd, 74', pin_signal: GND74}
  - {pin_num: W19, peripheral: PMU, signal: 'gnd, 87', pin_signal: GND87}
  - {pin_num: L19, peripheral: PMU, signal: nvcc_eim1, pin_signal: NVCC_EIM1}
