ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.c
  - {pin_num: M19, peripheral: PMU, signal: nvcc_eim2, pin_signal: NVCC_EIM2}
  - {pin_num: R19, peripheral: PMU, signal: nvcc_enet, pin_signal: NVCC_ENET}
  - {pin_num: AA19, peripheral: PMU, signal: 'gnd, 94', pin_signal: GND94}
  - {pin_num: AD19, peripheral: PMU, signal: 'gnd, 103', pin_signal: GND103}
  - {pin_num: F20, peripheral: ENET, signal: rgmii_td1, pin_signal: RGMII_TD1}
  - {pin_num: K20, peripheral: EIM, signal: weim_rw, pin_signal: EIM_RW}
  - {pin_num: L20, peripheral: EIM, signal: 'weim_da_a, 0', pin_signal: EIM_DA0}
  - {pin_num: M20, peripheral: EIM, signal: 'weim_da_a, 11', pin_signal: EIM_DA11}
  - {pin_num: E21, peripheral: ENET, signal: rgmii_td2, pin_signal: RGMII_TD2}
  - {pin_num: J21, peripheral: EIM, signal: 'weim_a, 23', pin_signal: EIM_A23}
  - {pin_num: K21, peripheral: EIM, signal: 'weim_eb, 0', pin_signal: EIM_EB0}
  - {pin_num: L21, peripheral: EIM, signal: 'weim_da_a, 2', pin_signal: EIM_DA2}
  - {pin_num: M21, peripheral: EIM, signal: 'weim_da_a, 9', pin_signal: EIM_DA9}
  - {pin_num: C22, peripheral: ENET, signal: rgmii_td0, pin_signal: RGMII_TD0}
  - {pin_num: D22, peripheral: ENET, signal: rgmii_rx_ctl, pin_signal: RGMII_RX_CTL}
  - {pin_num: E22, peripheral: EIM, signal: 'weim_eb, 2', pin_signal: EIM_EB2}
  - {pin_num: H22, peripheral: EIM, signal: 'weim_a, 20', pin_signal: EIM_A20}
  - {pin_num: J22, peripheral: EIM, signal: 'weim_a, 18', pin_signal: EIM_A18}
  - {pin_num: K22, peripheral: EIM, signal: weim_lba, pin_signal: EIM_LBA}
  - {pin_num: L22, peripheral: EIM, signal: 'weim_da_a, 4', pin_signal: EIM_DA4}
  - {pin_num: M22, peripheral: EIM, signal: 'weim_da_a, 10', pin_signal: EIM_DA10}
  - {pin_num: AA22, peripheral: PMU, signal: 'gnd, 95', pin_signal: GND95}
  - {pin_num: AD22, peripheral: PMU, signal: 'gnd, 104', pin_signal: GND104}
  - {pin_num: B23, peripheral: ENET, signal: rgmii_rd1, pin_signal: RGMII_RD1}
  - {pin_num: C23, peripheral: ENET, signal: rgmii_tx_ctl, pin_signal: RGMII_TX_CTL}
  - {pin_num: D23, peripheral: ENET, signal: rgmii_rd3, pin_signal: RGMII_RD3}
  - {pin_num: F23, peripheral: EIM, signal: 'weim_eb, 3', pin_signal: EIM_EB3}
  - {pin_num: H23, peripheral: EIM, signal: 'weim_a, 21', pin_signal: EIM_A21}
  - {pin_num: K23, peripheral: EIM, signal: 'weim_eb, 1', pin_signal: EIM_EB1}
  - {pin_num: L23, peripheral: EIM, signal: 'weim_da_a, 5', pin_signal: EIM_DA5}
  - {pin_num: M23, peripheral: EIM, signal: 'weim_da_a, 13', pin_signal: EIM_DA13}
  - {pin_num: N23, peripheral: EIM, signal: 'weim_da_a, 14', pin_signal: EIM_DA14}
  - {pin_num: A24, peripheral: ENET, signal: rgmii_td3, pin_signal: RGMII_TD3}
  - {pin_num: B24, peripheral: ENET, signal: rgmii_rd2, pin_signal: RGMII_RD2}
  - {pin_num: C24, peripheral: ENET, signal: rgmii_rd0, pin_signal: RGMII_RD0}
  - {pin_num: F24, peripheral: EIM, signal: 'weim_a, 22', pin_signal: EIM_A22}
  - {pin_num: G24, peripheral: EIM, signal: 'weim_a, 17', pin_signal: EIM_A17}
  - {pin_num: K24, peripheral: EIM, signal: 'weim_da_a, 3', pin_signal: EIM_DA3}
  - {pin_num: L24, peripheral: EIM, signal: 'weim_da_a, 8', pin_signal: EIM_DA8}
  - {pin_num: M24, peripheral: EIM, signal: 'weim_da_a, 12', pin_signal: EIM_DA12}
  - {pin_num: N24, peripheral: EIM, signal: 'weim_da_a, 15', pin_signal: EIM_DA15}
  - {pin_num: Y24, peripheral: PMU, signal: 'gnd, 89', pin_signal: GND89}
  - {pin_num: AB24, peripheral: PMU, signal: 'gnd, 97', pin_signal: GND97}
  - {pin_num: A25, peripheral: PMU, signal: 'gnd, 3', pin_signal: GND3}
  - {pin_num: B25, peripheral: ENET, signal: rgmii_rxc, pin_signal: RGMII_RXC}
  - {pin_num: F25, peripheral: EIM, signal: 'weim_a, 24', pin_signal: EIM_A24}
  - {pin_num: G25, peripheral: EIM, signal: 'weim_a, 19', pin_signal: EIM_A19}
  - {pin_num: H25, peripheral: EIM, signal: 'weim_a, 16', pin_signal: EIM_A16}
  - {pin_num: J25, peripheral: EIM, signal: 'weim_da_a, 1', pin_signal: EIM_DA1}
  - {pin_num: K25, peripheral: EIM, signal: 'weim_da_a, 6', pin_signal: EIM_DA6}
  - {pin_num: L25, peripheral: EIM, signal: 'weim_da_a, 7', pin_signal: EIM_DA7}
  - {pin_num: M25, peripheral: EIM, signal: weim_wait, pin_signal: EIM_WAIT}
  - {pin_num: V25, peripheral: GPIO5, signal: 'gpio, 12', pin_signal: DISP0_DAT18}
  - {pin_num: AE25, peripheral: PMU, signal: 'gnd, 106', pin_signal: GND106}
  - {pin_num: G22, peripheral: GPIO3, signal: 'gpio, 25', pin_signal: EIM_D25}
  - {pin_num: G23, peripheral: GPIO3, signal: 'gpio, 28', pin_signal: EIM_D28}
  - {pin_num: E24, peripheral: UART2, signal: txd_mux, pin_signal: EIM_D26}
  - {pin_num: E25, peripheral: UART2, signal: rxd_mux, pin_signal: EIM_D27}
  - {pin_num: W5, peripheral: ECSPI1, signal: sclk, pin_signal: KEY_COL0}
  - {pin_num: T4, peripheral: USB, signal: usbotg_id, pin_signal: GPIO_1, identifier: ''}
  - {pin_num: H20, peripheral: USB, signal: usbotg_oc, pin_signal: EIM_D21, identifier: ''}
  - {pin_num: E23, peripheral: USB, signal: usbotg_pwr, pin_signal: EIM_D22, identifier: ''}
  - {pin_num: H5, peripheral: SJC, signal: tck, pin_signal: JTAG_TCK}
  - {pin_num: C3, peripheral: SJC, signal: tms, pin_signal: JTAG_TMS}
  - {pin_num: C2, peripheral: SJC, signal: trstb, pin_signal: JTAG_TRSTB}
  - {pin_num: A6, peripheral: USB, signal: usb_otg_dp, pin_signal: USB_OTG_DP}
  - {pin_num: B6, peripheral: USB, signal: usb_otg_dn, pin_signal: USB_OTG_DN}
  - {pin_num: D21, peripheral: ENET, signal: rgmii_txc, pin_signal: RGMII_TXC}
  - {pin_num: F18, peripheral: PWM1, signal: pwmo, pin_signal: SD1_DAT3}
  - {pin_num: T2, peripheral: GPIO1, signal: 'gpio, 9', pin_signal: GPIO_9, identifier: ''}
  - {pin_num: W4, peripheral: GPIO4, signal: 'gpio, 11', pin_signal: KEY_ROW2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-A9 (Core #0)[ca9_0] */
  // HW_IOMUXC_ECSPI1_CSPI_CLK_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000002u);   /* IOMUXC_ECSPI1_CSPI_CLK_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_ECSPI1_MISO_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_ECSPI1_MISO_SELECT_INPUT register modification value */
  // HW_IOMUXC_ECSPI1_MOSI_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_ECSPI1_MOSI_SELECT_INPUT register modification value */
  // HW_IOMUXC_ECSPI1_SS0_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000002u);           /* IOMUXC_ECSPI1_SS0_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);       /* IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_CLK_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);     /* IOMUXC_ENET_MAC0_RX_CLK_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);   /* IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);   /* IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_DATA2_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);   /* IOMUXC_ENET_MAC0_RX_DATA2_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_DATA3_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);   /* IOMUXC_ENET_MAC0_RX_DATA3_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);      /* IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT register modification value */
  // HW_IOMUXC_FLEXCAN1_RX_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_FLEXCAN1_RX_SELECT_INPUT register modification value */
  // HW_IOMUXC_FLEXCAN2_RX_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);          /* IOMUXC_FLEXCAN2_RX_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C1_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_I2C1_SCL_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C1_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_I2C1_SDA_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C2_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_I2C2_SCL_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C2_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_I2C2_SDA_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C3_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);          /* IOMUXC_I2C3_SCL_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C3_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);          /* IOMUXC_I2C3_SDA_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_SET(IOMUXC_BASE, 0x00000004u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_CLR(IOMUXC_BASE, 0x00000003u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_SET(IOMUXC_BASE, 0x00000004u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_CLR(IOMUXC_BASE, 0x00000003u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_SET(IOMUXC_BASE, 0x00000003u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_CLR(IOMUXC_BASE, 0x00000004u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_SET(IOMUXC_BASE, 0x00000003u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_CLR(IOMUXC_BASE, 0x00000004u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD00_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD00 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD01_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD01 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD02_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD02 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD03_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD03 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD04_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD04 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD05_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD05 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD06_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD06 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD07_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD07 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD08_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD08 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD09_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD09 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD10_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD10 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD11_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD11 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD12_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD12 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD13_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD13 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD14_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD14 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD15_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD15 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_SET(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_CLR(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_SET(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_CLR(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_SET(IOMUXC_BASE, 0x00000004u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_CLR(IOMUXC_BASE, 0x00000003u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_SET(IOMUXC_BASE, 0x00000004u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_CLR(IOMUXC_BASE, 0x00000003u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_SET(IOMUXC_BASE, 0x00000004u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_CLR(IOMUXC_BASE, 0x00000003u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_SET(IOMUXC_BASE, 0x00000004u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_CLR(IOMUXC_BASE, 0x00000003u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29 register set mask value */
