ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.c
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA30_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA30 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA30_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA30 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA31_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA31 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA31_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA31 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_RW_CLR(IOMUXC_BASE, 0x00000007u);            /* IOMUXC_SW_MUX_CTL_PAD_EIM_RW register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_SET(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_SW_MUX_CTL_PAD_ENET_MDC register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_CLR(IOMUXC_BASE, 0x00000006u);          /* IOMUXC_SW_MUX_CTL_PAD_ENET_MDC register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_SET(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_CLR(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_SET(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_CLR(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO00_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO00 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO00_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO00 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO01_SET(IOMUXC_BASE, 0x00000003u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO01 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO01_CLR(IOMUXC_BASE, 0x00000004u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO01 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO02_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO02 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO02_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO02 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO03_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO03 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO03_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO03 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO04_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO04 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO04_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO04 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO05_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO05 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO05_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO05 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO06_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO06 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO06_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO06 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO07_SET(IOMUXC_BASE, 0x00000003u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO07 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO07_CLR(IOMUXC_BASE, 0x00000004u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO07 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO08_SET(IOMUXC_BASE, 0x00000003u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO08 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO08_CLR(IOMUXC_BASE, 0x00000004u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO08 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO09_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO09 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO09_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO09 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO16_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO16 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO16_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO16 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO17_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO17 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO17_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO17 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO18_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO18 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO18_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO18 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO19_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO19 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO19_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO19 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_SET(IOMUXC_BASE, 0x00000004u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL3 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_CLR(IOMUXC_BASE, 0x00000003u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL4 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_SET(IOMUXC_BASE, 0x00000005u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_CLR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_SET(IOMUXC_BASE, 0x00000004u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_CLR(IOMUXC_BASE, 0x00000003u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_CLR(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_ALE_SET(IOMUXC_BASE, 0x00000005u);          /* IOMUXC_SW_MUX_CTL_PAD_NAND_ALE register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_ALE_CLR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_SW_MUX_CTL_PAD_NAND_ALE register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CLE_SET(IOMUXC_BASE, 0x00000005u);          /* IOMUXC_SW_MUX_CTL_PAD_NAND_CLE register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CLE_CLR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_SW_MUX_CTL_PAD_NAND_CLE register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS0_B_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_NAND_CS0_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS0_B_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_NAND_CS0_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS1_B_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_NAND_CS1_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS1_B_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_NAND_CS1_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS2_B_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_NAND_CS2_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS2_B_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_NAND_CS2_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA04_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA04 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA04_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA04 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA06_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA06 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA06_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA06 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_READY_B_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_NAND_READY_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_READY_B_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_NAND_READY_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_WP_B_SET(IOMUXC_BASE, 0x00000005u);         /* IOMUXC_SW_MUX_CTL_PAD_NAND_WP_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_WP_B_CLR(IOMUXC_BASE, 0x00000002u);         /* IOMUXC_SW_MUX_CTL_PAD_NAND_WP_B register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD0_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RD0 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD0_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RD0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD1_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RD1 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD1_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RD1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD2_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RD2 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD2_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RD2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD3_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RD3 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD3_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RD3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RXC_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RXC register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RXC_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RXC register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RX_CTL_SET(IOMUXC_BASE, 0x00000001u);      /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RX_CTL register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RX_CTL_CLR(IOMUXC_BASE, 0x00000006u);      /* IOMUXC_SW_MUX_CTL_PAD_RGMII_RX_CTL register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD0_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TD0 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD0_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TD0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD1_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TD1 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD1_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TD1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD2_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TD2 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD2_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TD2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD3_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TD3 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD3_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TD3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TXC_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TXC register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TXC_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TXC register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_SET(IOMUXC_BASE, 0x00000001u);      /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_CLR(IOMUXC_BASE, 0x00000006u);      /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_SET(IOMUXC_BASE, 0x00000003u);         /* IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_CLR(IOMUXC_BASE, 0x00000004u);         /* IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_SET(IOMUXC_BASE, 0x00000003u);         /* IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_CLR(IOMUXC_BASE, 0x00000004u);         /* IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_CLK_CLR(IOMUXC_BASE, 0x00000007u);           /* IOMUXC_SW_MUX_CTL_PAD_SD3_CLK register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_CMD_CLR(IOMUXC_BASE, 0x00000007u);           /* IOMUXC_SW_MUX_CTL_PAD_SD3_CMD register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_RESET_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_RESET register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA4_SET(IOMUXC_BASE, 0x00000005u);         /* IOMUXC_SW_MUX_CTL_PAD_SD4_DATA4 register set mask value */
