ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.c
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA4_CLR(IOMUXC_BASE, 0x00000002u);         /* IOMUXC_SW_MUX_CTL_PAD_SD4_DATA4 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA5_SET(IOMUXC_BASE, 0x00000005u);         /* IOMUXC_SW_MUX_CTL_PAD_SD4_DATA5 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA5_CLR(IOMUXC_BASE, 0x00000002u);         /* IOMUXC_SW_MUX_CTL_PAD_SD4_DATA5 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA6_SET(IOMUXC_BASE, 0x00000005u);         /* IOMUXC_SW_MUX_CTL_PAD_SD4_DATA6 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA6_CLR(IOMUXC_BASE, 0x00000002u);         /* IOMUXC_SW_MUX_CTL_PAD_SD4_DATA6 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA7_SET(IOMUXC_BASE, 0x00000005u);         /* IOMUXC_SW_MUX_CTL_PAD_SD4_DATA7 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA7_CLR(IOMUXC_BASE, 0x00000002u);         /* IOMUXC_SW_MUX_CTL_PAD_SD4_DATA7 register clear mask value */
  // HW_IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT register modification value */
  // HW_IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT register modification value */
  // HW_IOMUXC_USB_OTG_OC_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);           /* IOMUXC_USB_OTG_OC_SELECT_INPUT register modification value */
  // Note: The commented code above is generated by the tool in case of simplified register modification using direct values only are needed.
  HW_IOMUXC_ECSPI1_CSPI_CLK_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ECSPI1_CSPI_CLK_IN_SELECT_INPUT_DAISY(BV_IOMUXC_ECSPI1_CSPI_CLK_IN_SELECT_INPUT_DAISY_KEY_COL0_ALT0)); /* Input Select (DAISY) Field: Selecting ALT0MUX Mode Select Field. mode of pad KEY_COL0 for ECSPI1_SCLK. */
  HW_IOMUXC_ECSPI1_MISO_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ECSPI1_MISO_SELECT_INPUT_DAISY(BV_IOMUXC_ECSPI1_MISO_SELECT_INPUT_DAISY_KEY_COL1_ALT0));     /* Input Select (DAISY) Field: Selecting ALT0MUX Mode Select Field. mode of pad KEY_COL1 for ECSPI1_MISO. */
  HW_IOMUXC_ECSPI1_MOSI_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ECSPI1_MOSI_SELECT_INPUT_DAISY(BV_IOMUXC_ECSPI1_MOSI_SELECT_INPUT_DAISY_KEY_ROW0_ALT0));     /* Input Select (DAISY) Field: Selecting ALT0MUX Mode Select Field. mode of pad KEY_ROW0 for ECSPI1_MOSI. */
  HW_IOMUXC_ECSPI1_SS0_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ECSPI1_SS0_SELECT_INPUT_DAISY(BV_IOMUXC_ECSPI1_SS0_SELECT_INPUT_DAISY_KEY_ROW1_ALT0));       /* Input Select (DAISY) Field: Selecting ALT0MUX Mode Select Field. mode of pad KEY_ROW1 for ECSPI1_SS0. */
  HW_IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT_DAISY_ENET_MDIO_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad ENET_MDIO for ENET_MDIO. */
  HW_IOMUXC_ENET_MAC0_RX_CLK_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_CLK_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_CLK_SELECT_INPUT_DAISY_RGMII_RXC_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad RGMII_RXC for RGMII_RXC. */
  HW_IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT_DAISY_RGMII_RD0_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad RGMII_RD0 for RGMII_RD0. */
  HW_IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT_DAISY_RGMII_RD1_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad RGMII_RD1 for RGMII_RD1. */
  HW_IOMUXC_ENET_MAC0_RX_DATA2_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_DATA2_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_DATA2_SELECT_INPUT_DAISY_RGMII_RD2_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad RGMII_RD2 for RGMII_RD2. */
  HW_IOMUXC_ENET_MAC0_RX_DATA3_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_DATA3_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_DATA3_SELECT_INPUT_DAISY_RGMII_RD3_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad RGMII_RD3 for RGMII_RD3. */
  HW_IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT_DAISY_RGMII_RX_CTL_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad RGMII_RX_CTL for RGMII_RX_CTL. */
  HW_IOMUXC_FLEXCAN1_RX_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY(BV_IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY_GPIO08_ALT3));       /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad GPIO_8 for FLEXCAN1_RX. */
  HW_IOMUXC_FLEXCAN2_RX_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_FLEXCAN2_RX_SELECT_INPUT_DAISY(BV_IOMUXC_FLEXCAN2_RX_SELECT_INPUT_DAISY_KEY_ROW4_ALT0));     /* Input Select (DAISY) Field: Selecting ALT0MUX Mode Select Field. mode of pad KEY_ROW4 for FLEXCAN2_RX. */
  HW_IOMUXC_I2C1_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C1_SCL_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C1_SCL_IN_SELECT_INPUT_DAISY_CSI0_DATA09_ALT4));  /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad CSI0_DAT9 for I2C1_SCL. */
  HW_IOMUXC_I2C1_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C1_SDA_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C1_SDA_IN_SELECT_INPUT_DAISY_CSI0_DATA08_ALT4));  /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad CSI0_DAT8 for I2C1_SDA. */
  HW_IOMUXC_I2C2_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C2_SCL_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C2_SCL_IN_SELECT_INPUT_DAISY_KEY_COL3_ALT4));     /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad KEY_COL3 for I2C2_SCL. */
  HW_IOMUXC_I2C2_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C2_SDA_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C2_SDA_IN_SELECT_INPUT_DAISY_KEY_ROW3_ALT4));     /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad KEY_ROW3 for I2C2_SDA. */
  HW_IOMUXC_I2C3_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C3_SCL_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C3_SCL_IN_SELECT_INPUT_DAISY_EIM_DATA17_ALT6));   /* Input Select (DAISY) Field: Selecting ALT6MUX Mode Select Field. mode of pad EIM_D17 for I2C3_SCL. */
  HW_IOMUXC_I2C3_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C3_SDA_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C3_SDA_IN_SELECT_INPUT_DAISY_EIM_DATA18_ALT6));   /* Input Select (DAISY) Field: Selecting ALT6MUX Mode Select Field. mode of pad EIM_D18 for I2C3_SDA. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_MUX_MODE_ALT4));    /* MUX Mode Select Field: Select signal I2C1_SDA.- Configure register IOMUXC_I2C1_SDA_IN_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_MUX_MODE_ALT4));    /* MUX Mode Select Field: Select signal I2C1_SCL.- Configure register IOMUXC_I2C1_SCL_IN_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_MUX_MODE_ALT3));    /* MUX Mode Select Field: Select signal UART1_TX_DATA.- Configure register IOMUXC_UART1_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_MUX_MODE_ALT3));    /* MUX Mode Select Field: Select signal UART1_RX_DATA.- Configure register IOMUXC_UART1_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO5_IO12. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD00_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD00_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD00_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD00. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD01_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD01_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD01_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD01. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD02_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD02_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD02_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD02. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD03_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD03_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD03_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD03. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD04_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD04_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD04_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD04. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD05_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD05_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD05_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD05. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD06_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD06_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD06_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD06. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD07_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD07_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD07_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD07. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD08_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD08_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD08_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD08. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD09_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD09_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD09_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD09. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD10_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD10_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD10_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD10. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD11_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD11_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD11_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD11. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD12_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD12_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD12_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD12. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD13_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD13_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD13_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD13. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD14_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD14_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD14_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD14. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD15_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD15_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD15_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal EIM_AD15. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR16. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR17. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR18. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR19. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR20. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR21. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR22. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR23. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_ADDR24. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO16. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_MUX_MODE_ALT6));      /* MUX Mode Select Field: Select signal I2C3_SCL.- Configure register IOMUXC_I2C3_SCL_IN_SELECT_INPUTSelect Input Register for mode ALT6. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_MUX_MODE_ALT6));      /* MUX Mode Select Field: Select signal I2C3_SDA.- Configure register IOMUXC_I2C3_SDA_IN_SELECT_INPUTSelect Input Register for mode ALT6. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO19. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO20. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_MUX_MODE_ALT4));      /* MUX Mode Select Field: Select signal USB_OTG_OC.- Configure register IOMUXC_USB_OTG_OC_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_MUX_MODE_ALT4));      /* MUX Mode Select Field: Select signal USB_OTG_PWR. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO23. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO24. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO25. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_MUX_MODE_ALT4));      /* MUX Mode Select Field: Select signal UART2_TX_DATA.- Configure register IOMUXC_UART2_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_MUX_MODE_ALT4));      /* MUX Mode Select Field: Select signal UART2_RX_DATA.- Configure register IOMUXC_UART2_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO28. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO29. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA30_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA30_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA30_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO30. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA31_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA31_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA31_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO31. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal EIM_EB0_B. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B_WR(IOMUXC_BASE,
