ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.c
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal EIM_EB1_B. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal EIM_EB2_B. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal EIM_EB3_B. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal EIM_LBA_B. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_RW_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_RW_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_RW_MUX_MODE_ALT0));              /* MUX Mode Select Field: Select signal EIM_RW. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal EIM_WAIT_B. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_MUX_MODE_ALT1));          /* MUX Mode Select Field: Select signal ENET_MDC. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal ENET_MDIO.- Configure register IOMUXC_ENET_MAC0_MDIO_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_MUX_MODE_ALT1));      /* MUX Mode Select Field: Select signal ENET_RX_ER. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_MUX_MODE_ALT1));      /* MUX Mode Select Field: Select signal ENET_TX_EN. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO00_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO00_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO00_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO00. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO01_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO01_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO01_MUX_MODE_ALT3));              /* MUX Mode Select Field: Select signal USB_OTG_ID. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO02_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO02_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO02_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO02. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO03_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO03_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO03_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO03. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO04_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO04_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO04_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO04. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO05_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO05_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO05_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO05. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO06_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO06_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO06_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO06. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO07_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO07_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO07_MUX_MODE_ALT3));              /* MUX Mode Select Field: Select signal FLEXCAN1_TX. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO08_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO08_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO08_MUX_MODE_ALT3));              /* MUX Mode Select Field: Select signal FLEXCAN1_RX.- Configure register IOMUXC_FLEXCAN1_RX_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO09_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO09_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO09_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO09. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO16_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO16_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO16_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO7_IO11. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO17_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO17_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO17_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO7_IO12. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO18_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO7_IO13. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO19_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO19_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO19_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO4_IO05. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal ECSPI1_SCLK.- Configure register IOMUXC_ECSPI1_CSPI_CLK_IN_SELECT_INPUTSelect Input Register for mode ALT0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal ECSPI1_MISO.- Configure register IOMUXC_ECSPI1_MISO_SELECT_INPUTSelect Input Register for mode ALT0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_MUX_MODE_ALT4));          /* MUX Mode Select Field: Select signal I2C2_SCL.- Configure register IOMUXC_I2C2_SCL_IN_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal FLEXCAN2_TX. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal ECSPI1_MOSI.- Configure register IOMUXC_ECSPI1_MOSI_SELECT_INPUTSelect Input Register for mode ALT0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal ECSPI1_SS0.- Configure register IOMUXC_ECSPI1_SS0_SELECT_INPUTSelect Input Register for mode ALT0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_MUX_MODE_ALT5));          /* MUX Mode Select Field: Select signal GPIO4_IO11. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_MUX_MODE_ALT4));          /* MUX Mode Select Field: Select signal I2C2_SDA.- Configure register IOMUXC_I2C2_SDA_IN_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_MUX_MODE_ALT0));          /* MUX Mode Select Field: Select signal FLEXCAN2_RX.- Configure register IOMUXC_FLEXCAN2_RX_SELECT_INPUTSelect Input Register for mode ALT0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_ALE_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_ALE_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_ALE_MUX_MODE_ALT5));          /* MUX Mode Select Field: Select signal GPIO6_IO08. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CLE_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_CLE_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_CLE_MUX_MODE_ALT5));          /* MUX Mode Select Field: Select signal GPIO6_IO07. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS0_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_CS0_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_CS0_B_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO6_IO11. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS1_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_CS1_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_CS1_B_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO6_IO14. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_CS2_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_CS2_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_CS2_B_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO6_IO15. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO00. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO01. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO02. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO03. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA04_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA04_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA04_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO04. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA06_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA06_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA06_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO06. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_READY_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_READY_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_READY_B_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO6_IO10. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_WP_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_WP_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_WP_B_MUX_MODE_ALT5));        /* MUX Mode Select Field: Select signal GPIO6_IO09. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD0_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_RD0.- Configure register IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD1_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_RD1.- Configure register IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD2_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_RD2.- Configure register IOMUXC_ENET_MAC0_RX_DATA2_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_RD3_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_RD3.- Configure register IOMUXC_ENET_MAC0_RX_DATA3_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RXC_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_RXC_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_RXC_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_RXC.- Configure register IOMUXC_ENET_MAC0_RX_CLK_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_RX_CTL_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_RX_CTL_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_RX_CTL_MUX_MODE_ALT1));  /* MUX Mode Select Field: Select signal RGMII_RX_CTL.- Configure register IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD0_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_TD0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD1_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_TD1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD2_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_TD2. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_TD3_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_TD3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TXC_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_TXC_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_TXC_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal RGMII_TXC. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_MUX_MODE_ALT1));  /* MUX Mode Select Field: Select signal RGMII_TX_CTL. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_MUX_MODE_ALT3));        /* MUX Mode Select Field: Select signal PWM2_OUT. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_MUX_MODE_ALT3));        /* MUX Mode Select Field: Select signal PWM1_OUT. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_CLK_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_CLK_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_CLK_MUX_MODE_ALT0));            /* MUX Mode Select Field: Select signal SD3_CLK. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_CMD_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_CMD_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_CMD_MUX_MODE_ALT0));            /* MUX Mode Select Field: Select signal SD3_CMD. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA2. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA5. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA6. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA7. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_RESET_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_RESET_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_RESET_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_RESET. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA4_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA4_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA4_MUX_MODE_ALT5));        /* MUX Mode Select Field: Select signal GPIO2_IO12. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA5_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA5_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA5_MUX_MODE_ALT5));        /* MUX Mode Select Field: Select signal GPIO2_IO13. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA6_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA6_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA6_MUX_MODE_ALT5));        /* MUX Mode Select Field: Select signal GPIO2_IO14. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA7_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA7_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD4_DATA7_MUX_MODE_ALT5));        /* MUX Mode Select Field: Select signal GPIO2_IO15. */
  HW_IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT_DAISY(BV_IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT_DAISY_CSI0_DATA11_ALT3)); /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad CSI0_DAT11 for UART1_RX_DATA. */
  HW_IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT_DAISY(BV_IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT_DAISY_EIM_DATA27_ALT4)); /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad EIM_D27 for UART2_RX_DATA. */
  HW_IOMUXC_USB_OTG_OC_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_USB_OTG_OC_SELECT_INPUT_DAISY(BV_IOMUXC_USB_OTG_OC_SELECT_INPUT_DAISY_EIM_DATA21_ALT4));     /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad EIM_D21 for USB_OTG_OC. */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
